zlgopen/ametal/soc/hdsc/hc32/hc32x3x_pin.h
/**
 * \name PIOA_15引脚复用时功能模式
 * @{
 */
#define PIOA_15_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOA_15_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOA_15_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOA_15_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOA_15_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOA_15_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOA_15_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOB_0引脚复用功能
 * @{
 */
#define PIOB_0_GPIO           AM_HC32_GPIO_REMAP_CODE(0x02, 0)
#define PIOB_0_PCA_CH2        AM_HC32_GPIO_REMAP_CODE(0x02, 1)
#define PIOB_0_TIM3_CH1B      AM_HC32_GPIO_REMAP_CODE(0x02, 2)
#define PIOB_0_LPUART0_TXD    AM_HC32_GPIO_REMAP_CODE(0x02, 3)
#define PIOB_0_TIM5_CHB       AM_HC32_GPIO_REMAP_CODE(0x02, 4)
#define PIOB_0_RCH_OUT        AM_HC32_GPIO_REMAP_CODE(0x02, 5)
#define PIOB_0_RCL_OUT        AM_HC32_GPIO_REMAP_CODE(0x02, 6)
#define PIOB_0_PLL_OUT        AM_HC32_GPIO_REMAP_CODE(0x02, 7)

/** @} */

/**
 * \name PIOB_0引脚复用时功能模式
 * @{
 */
#define PIOB_0_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOB_0_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOB_0_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOB_0_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOB_0_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOB_0_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOB_0_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOB_1引脚复用功能
 * @{
 */
#define PIOB_1_GPIO           AM_HC32_GPIO_REMAP_CODE(0x02, 0)
#define PIOB_1_PCA_CH3        AM_HC32_GPIO_REMAP_CODE(0x02, 1)
#define PIOB_1_PCLK_OUT       AM_HC32_GPIO_REMAP_CODE(0x02, 2)
#define PIOB_1_TIM3_CH2B      AM_HC32_GPIO_REMAP_CODE(0x02, 3)
#define PIOB_1_TIM6_CHB       AM_HC32_GPIO_REMAP_CODE(0x02, 4)
#define PIOB_1_LPUART0_RTS    AM_HC32_GPIO_REMAP_CODE(0x02, 5)

/** @} */

/**
 * \name PIOB_1引脚复用时功能模式
 * @{
 */
#define PIOB_1_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOB_1_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOB_1_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOB_1_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOB_1_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOB_1_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOB_1_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOB_2引脚复用功能
 * @{
 */
#define PIOB_2_GPIO           AM_HC32_GPIO_REMAP_CODE(0x02, 0)
#define PIOB_2_LPTIM0_TOG     AM_HC32_GPIO_REMAP_CODE(0x02, 1)
#define PIOB_2_PCA_ECI        AM_HC32_GPIO_REMAP_CODE(0x02, 2)
#define PIOB_2_LPUART1_TXD    AM_HC32_GPIO_REMAP_CODE(0x02, 3)
#define PIOB_2_TIM4_CHA       AM_HC32_GPIO_REMAP_CODE(0x02, 4)
#define PIOB_2_TIM1_BK        AM_HC32_GPIO_REMAP_CODE(0x02, 5)
#define PIOB_2_TIM0_BK        AM_HC32_GPIO_REMAP_CODE(0x02, 6)
#define PIOB_2_TIM2_BK        AM_HC32_GPIO_REMAP_CODE(0x02, 7)

/** @} */

/**
 * \name PIOB_2引脚复用时功能模式
 * @{
 */
#define PIOB_2_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOB_2_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOB_2_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOB_2_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOB_2_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOB_2_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOB_2_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOB_3引脚复用功能
 * @{
 */
#define PIOB_3_GPIO           AM_HC32_GPIO_REMAP_CODE(0x02, 0)
#define PIOB_3_SPI0_SCK       AM_HC32_GPIO_REMAP_CODE(0x02, 1)
#define PIOB_3_TIM0_CHB       AM_HC32_GPIO_REMAP_CODE(0x02, 2)
#define PIOB_3_TIM1_GATE      AM_HC32_GPIO_REMAP_CODE(0x02, 3)
#define PIOB_3_TIM3_CH0A      AM_HC32_GPIO_REMAP_CODE(0x02, 4)
#define PIOB_3_LPTIM0_GATE    AM_HC32_GPIO_REMAP_CODE(0x02, 5)
#define PIOB_3_XTL_OUT        AM_HC32_GPIO_REMAP_CODE(0x02, 6)
#define PIOB_3_XTH_OUT        AM_HC32_GPIO_REMAP_CODE(0x02, 7)

/** @} */

/**
 * \name PIOB_3引脚复用时功能模式
 * @{
 */
#define PIOB_3_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOB_3_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOB_3_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOB_3_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOB_3_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOB_3_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOB_3_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOB_4引脚复用功能
 * @{
 */
#define PIOB_4_GPIO           AM_HC32_GPIO_REMAP_CODE(0x02, 0)
#define PIOB_4_SPI0_MISO      AM_HC32_GPIO_REMAP_CODE(0x02, 1)
#define PIOB_4_PCA_CH0        AM_HC32_GPIO_REMAP_CODE(0x02, 2)
#define PIOB_4_TIM2_BK        AM_HC32_GPIO_REMAP_CODE(0x02, 3)
#define PIOB_4_UART0_CTS      AM_HC32_GPIO_REMAP_CODE(0x02, 4)
#define PIOB_4_TIM2_GATE      AM_HC32_GPIO_REMAP_CODE(0x02, 5)
#define PIOB_4_TIM3_CH0B      AM_HC32_GPIO_REMAP_CODE(0x02, 6)
#define PIOB_4_LPTIM0_ETR     AM_HC32_GPIO_REMAP_CODE(0x02, 7)

/** @} */

/**
 * \name PIOB_4引脚复用时功能模式
 * @{
 */
#define PIOB_4_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOB_4_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOB_4_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOB_4_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOB_4_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOB_4_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOB_4_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOB_5引脚复用功能
 * @{
 */
#define PIOB_5_GPIO           AM_HC32_GPIO_REMAP_CODE(0x02, 0)
#define PIOB_5_SPI0_MOSI      AM_HC32_GPIO_REMAP_CODE(0x02, 1)
#define PIOB_5_TIM1_BK        AM_HC32_GPIO_REMAP_CODE(0x02, 3)
#define PIOB_5_PCA_CH1        AM_HC32_GPIO_REMAP_CODE(0x02, 4)
#define PIOB_5_LPTIM0_GATE    AM_HC32_GPIO_REMAP_CODE(0x02, 5)
#define PIOB_5_PCNT_S0        AM_HC32_GPIO_REMAP_CODE(0x02, 6)
#define PIOB_5_UART0_RTS      AM_HC32_GPIO_REMAP_CODE(0x02, 7)

/** @} */

/**
 * \name PIOB_5引脚复用时功能模式
 * @{
 */
#define PIOB_5_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOB_5_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOB_5_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOB_5_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOB_5_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOB_5_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOB_5_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOB_6引脚复用功能
 * @{
 */
#define PIOB_6_GPIO           AM_HC32_GPIO_REMAP_CODE(0x02, 0)
#define PIOB_6_I2C0_SCL       AM_HC32_GPIO_REMAP_CODE(0x02, 1)
#define PIOB_6_UART0_TXD      AM_HC32_GPIO_REMAP_CODE(0x02, 2)
#define PIOB_6_TIM1_CHB       AM_HC32_GPIO_REMAP_CODE(0x02, 3)
#define PIOB_6_TIM0_CHA       AM_HC32_GPIO_REMAP_CODE(0x02, 4)
#define PIOB_6_LPTIM0_ETR     AM_HC32_GPIO_REMAP_CODE(0x02, 5)
#define PIOB_6_TIM3_CH0A      AM_HC32_GPIO_REMAP_CODE(0x02, 6)
#define PIOB_6_LPTIM0_TOG     AM_HC32_GPIO_REMAP_CODE(0x02, 7)

/** @} */

/**
 * \name PIOB_6引脚复用时功能模式
 * @{
 */
#define PIOB_6_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOB_6_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOB_6_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOB_6_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOB_6_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOB_6_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOB_6_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOB_7引脚复用功能
 * @{
 */
#define PIOB_7_GPIO           AM_HC32_GPIO_REMAP_CODE(0x02, 0)
#define PIOB_7_I2C0_SDA       AM_HC32_GPIO_REMAP_CODE(0x02, 1)
#define PIOB_7_UART0_RXD      AM_HC32_GPIO_REMAP_CODE(0x02, 2)
#define PIOB_7_TIM2_CHB       AM_HC32_GPIO_REMAP_CODE(0x02, 3)
#define PIOB_7_LPUART1_CTS    AM_HC32_GPIO_REMAP_CODE(0x02, 4)
#define PIOB_7_TIM0_CHB       AM_HC32_GPIO_REMAP_CODE(0x02, 5)
#define PIOB_7_LPTIM0_TOGN    AM_HC32_GPIO_REMAP_CODE(0x02, 6)
#define PIOB_7_PCNT_S1        AM_HC32_GPIO_REMAP_CODE(0x02, 7)

/** @} */

/**
 * \name PIOB_7引脚复用时功能模式
 * @{
 */
#define PIOB_7_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOB_7_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOB_7_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOB_7_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOB_7_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOB_7_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOB_7_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOB_8引脚复用功能
 * @{
 */
#define PIOB_8_GPIO           AM_HC32_GPIO_REMAP_CODE(0x02, 0)
#define PIOB_8_I2C0_SCL       AM_HC32_GPIO_REMAP_CODE(0x02, 1)
#define PIOB_8_TIM1_CHA       AM_HC32_GPIO_REMAP_CODE(0x02, 2)
#define PIOB_8_TIM2_CHA       AM_HC32_GPIO_REMAP_CODE(0x02, 4)
#define PIOB_8_TIM0_GATE      AM_HC32_GPIO_REMAP_CODE(0x02, 5)
#define PIOB_8_TIM3_CH2A      AM_HC32_GPIO_REMAP_CODE(0x02, 6)
#define PIOB_8_UART0_TXD      AM_HC32_GPIO_REMAP_CODE(0x02, 7)

/** @} */

/**
 * \name PIOB_8引脚复用时功能模式
 * @{
 */
#define PIOB_8_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOB_8_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOB_8_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOB_8_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOB_8_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOB_8_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOB_8_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOB_9引脚复用功能
 * @{
 */
#define PIOB_9_GPIO           AM_HC32_GPIO_REMAP_CODE(0x02, 0)
#define PIOB_9_I2C0_SDA       AM_HC32_GPIO_REMAP_CODE(0x02, 1)
#define PIOB_9_IR_OUT         AM_HC32_GPIO_REMAP_CODE(0x02, 2)
#define PIOB_9_SPI1_CS        AM_HC32_GPIO_REMAP_CODE(0x02, 3)
#define PIOB_9_TIM2_CHA       AM_HC32_GPIO_REMAP_CODE(0x02, 4)
#define PIOB_9_TIM2_CHB       AM_HC32_GPIO_REMAP_CODE(0x02, 6)
#define PIOB_9_UART0_RXD      AM_HC32_GPIO_REMAP_CODE(0x02, 7)

/** @} */

/**
 * \name PIOB_9引脚复用时功能模式
 * @{
 */
#define PIOB_9_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOB_9_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOB_9_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOB_9_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOB_9_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOB_9_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOB_9_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOB_10引脚复用功能
 * @{
 */
#define PIOB_10_GPIO           AM_HC32_GPIO_REMAP_CODE(0x02, 0)
#define PIOB_10_I2C1_SCL       AM_HC32_GPIO_REMAP_CODE(0x02, 1)
#define PIOB_10_SPI1_SCK       AM_HC32_GPIO_REMAP_CODE(0x02, 2)
#define PIOB_10_TIM1_CHA       AM_HC32_GPIO_REMAP_CODE(0x02, 3)
#define PIOB_10_LPUART0_TXD    AM_HC32_GPIO_REMAP_CODE(0x02, 4)
#define PIOB_10_TIM3_CH1A      AM_HC32_GPIO_REMAP_CODE(0x02, 5)
#define PIOB_10_LPUART1_RTS    AM_HC32_GPIO_REMAP_CODE(0x02, 6)
#define PIOB_10_UART1_RTS      AM_HC32_GPIO_REMAP_CODE(0x02, 7)

/** @} */

/**
 * \name PIOB_10引脚复用时功能模式
 * @{
 */
#define PIOB_10_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOB_10_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOB_10_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOB_10_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOB_10_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOB_10_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOB_10_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOB_11引脚复用功能
 * @{
 */
#define PIOB_11_GPIO           AM_HC32_GPIO_REMAP_CODE(0x02, 0)
#define PIOB_11_I2C1_SDA       AM_HC32_GPIO_REMAP_CODE(0x02, 1)
#define PIOB_11_TIM1_CHB       AM_HC32_GPIO_REMAP_CODE(0x02, 2)
#define PIOB_11_LPUART0_RXD    AM_HC32_GPIO_REMAP_CODE(0x02, 3)
#define PIOB_11_TIM2_GATE      AM_HC32_GPIO_REMAP_CODE(0x02, 4)
#define PIOB_11_TIM6_CHA       AM_HC32_GPIO_REMAP_CODE(0x02, 5)
#define PIOB_11_LPUART1_CTS    AM_HC32_GPIO_REMAP_CODE(0x02, 6)
#define PIOB_11_UART1_CTS      AM_HC32_GPIO_REMAP_CODE(0x02, 7)

/** @} */

/**
 * \name PIOB_11引脚复用时功能模式
 * @{
 */
#define PIOB_11_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOB_11_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOB_11_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOB_11_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOB_11_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOB_11_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOB_11_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOB_12引脚复用功能
 * @{
 */
#define PIOB_12_GPIO           AM_HC32_GPIO_REMAP_CODE(0x02, 0)
#define PIOB_12_SPI1_CS        AM_HC32_GPIO_REMAP_CODE(0x02, 1)
#define PIOB_12_TIM3_BK        AM_HC32_GPIO_REMAP_CODE(0x02, 2)
#define PIOB_12_LPUART0_TXD    AM_HC32_GPIO_REMAP_CODE(0x02, 3)
#define PIOB_12_TIM0_BK        AM_HC32_GPIO_REMAP_CODE(0x02, 4)
#define PIOB_12_LPUART0_RTS    AM_HC32_GPIO_REMAP_CODE(0x02, 6)
#define PIOB_12_TIM6_CHA       AM_HC32_GPIO_REMAP_CODE(0x02, 7)

/** @} */

/**
 * \name PIOB_12引脚复用时功能模式
 * @{
 */
#define PIOB_12_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOB_12_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOB_12_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOB_12_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOB_12_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOB_12_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOB_12_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOB_13引脚复用功能
 * @{
 */
#define PIOB_13_GPIO           AM_HC32_GPIO_REMAP_CODE(0x02, 0)
#define PIOB_13_SPI1_SCK       AM_HC32_GPIO_REMAP_CODE(0x02, 1)
#define PIOB_13_I2C1_SCL       AM_HC32_GPIO_REMAP_CODE(0x02, 2)
#define PIOB_13_TIM3_CH0B      AM_HC32_GPIO_REMAP_CODE(0x02, 3)
#define PIOB_13_LPUART0_CTS    AM_HC32_GPIO_REMAP_CODE(0x02, 4)
#define PIOB_13_TIM1_CHA       AM_HC32_GPIO_REMAP_CODE(0x02, 5)
#define PIOB_13_TIM1_GATE      AM_HC32_GPIO_REMAP_CODE(0x02, 6)
#define PIOB_13_TIM6_CHB       AM_HC32_GPIO_REMAP_CODE(0x02, 7)

/** @} */

/**
 * \name PIOB_13引脚复用时功能模式
 * @{
 */
#define PIOB_13_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOB_13_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOB_13_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOB_13_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOB_13_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOB_13_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOB_13_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOB_14引脚复用功能
 * @{
 */
#define PIOB_14_GPIO           AM_HC32_GPIO_REMAP_CODE(0x02, 0)
#define PIOB_14_SPI1_MISO      AM_HC32_GPIO_REMAP_CODE(0x02, 1)
#define PIOB_14_I2C1_SDA       AM_HC32_GPIO_REMAP_CODE(0x02, 2)
#define PIOB_14_TIM3_CH1B      AM_HC32_GPIO_REMAP_CODE(0x02, 3)
#define PIOB_14_TIM0_CHA       AM_HC32_GPIO_REMAP_CODE(0x02, 4)
#define PIOB_14_RTC_1HZ        AM_HC32_GPIO_REMAP_CODE(0x02, 5)
#define PIOB_14_LPUART0_RTS    AM_HC32_GPIO_REMAP_CODE(0x02, 6)
#define PIOB_14_TIM1_BK        AM_HC32_GPIO_REMAP_CODE(0x02, 7)

/** @} */

/**
 * \name PIOB_14引脚复用时功能模式
 * @{
 */
#define PIOB_14_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOB_14_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOB_14_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOB_14_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOB_14_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOB_14_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOB_14_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOB_15引脚复用功能
 * @{
 */
#define PIOB_15_GPIO           AM_HC32_GPIO_REMAP_CODE(0x02, 0)
#define PIOB_15_SPI1_MOSI      AM_HC32_GPIO_REMAP_CODE(0x02, 1)
#define PIOB_15_TIM3_CH2B      AM_HC32_GPIO_REMAP_CODE(0x02, 2)
#define PIOB_15_TIM0_CHB       AM_HC32_GPIO_REMAP_CODE(0x02, 3)
#define PIOB_15_TIM0_GATE      AM_HC32_GPIO_REMAP_CODE(0x02, 4)
#define PIOB_15_LPUART1_RXD    AM_HC32_GPIO_REMAP_CODE(0x02, 7)

/** @} */

/**
 * \name PIOB_15引脚复用时功能模式
 * @{
 */
#define PIOB_15_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOB_15_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOB_15_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOB_15_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOB_15_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOB_15_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOB_15_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOC_0引脚复用功能
 * @{
 */
#define PIOC_0_GPIO           AM_HC32_GPIO_REMAP_CODE(0x03, 0)
#define PIOC_0_LPTIM0_GATE    AM_HC32_GPIO_REMAP_CODE(0x03, 1)
#define PIOC_0_PCNT_S0        AM_HC32_GPIO_REMAP_CODE(0x03, 2)
#define PIOC_0_UART1_CTS      AM_HC32_GPIO_REMAP_CODE(0x03, 3)

/** @} */

/**
 * \name PIOC_0引脚复用时功能模式
 * @{
 */
#define PIOC_0_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOC_0_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOC_0_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOC_0_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOC_0_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOC_0_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOC_0_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOC_1引脚复用功能
 * @{
 */
#define PIOC_1_GPIO           AM_HC32_GPIO_REMAP_CODE(0x03, 0)
#define PIOC_1_LPTIM0_TOG     AM_HC32_GPIO_REMAP_CODE(0x03, 1)
#define PIOC_1_TIM5_CHB       AM_HC32_GPIO_REMAP_CODE(0x03, 2)
#define PIOC_1_UART1_RTS      AM_HC32_GPIO_REMAP_CODE(0x03, 3)

/** @} */

/**
 * \name PIOC_1引脚复用时功能模式
 * @{
 */
#define PIOC_1_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOC_1_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOC_1_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOC_1_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOC_1_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOC_1_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOC_1_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOC_2引脚复用功能
 * @{
 */
#define PIOC_2_GPIO           AM_HC32_GPIO_REMAP_CODE(0x03, 0)
#define PIOC_2_SPI1_MISO      AM_HC32_GPIO_REMAP_CODE(0x03, 1)
#define PIOC_2_LPTIM0_TOGN    AM_HC32_GPIO_REMAP_CODE(0x03, 2)
#define PIOC_2_PCNT_S1        AM_HC32_GPIO_REMAP_CODE(0x03, 3)

/** @} */

/**
 * \name PIOC_2引脚复用时功能模式
 * @{
 */
#define PIOC_2_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOC_2_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOC_2_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOC_2_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOC_2_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOC_2_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOC_2_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOC_3引脚复用功能
 * @{
 */
#define PIOC_3_GPIO           AM_HC32_GPIO_REMAP_CODE(0x03, 0)
#define PIOC_3_SPI1_MOSI      AM_HC32_GPIO_REMAP_CODE(0x03, 1)
#define PIOC_3_LPTIM0_ETR     AM_HC32_GPIO_REMAP_CODE(0x03, 2)
#define PIOC_3_LPTIM0_TOGN    AM_HC32_GPIO_REMAP_CODE(0x03, 3)

/** @} */

/**
 * \name PIOC_3引脚复用时功能模式
 * @{
 */
#define PIOC_3_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOC_3_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOC_3_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOC_3_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOC_3_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOC_3_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOC_3_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOC_4引脚复用功能
 * @{
 */
#define PIOC_4_GPIO           AM_HC32_GPIO_REMAP_CODE(0x03, 0)
#define PIOC_4_LPUART0_TXD    AM_HC32_GPIO_REMAP_CODE(0x03, 1)
#define PIOC_4_TIM2_ETR       AM_HC32_GPIO_REMAP_CODE(0x03, 2)
#define PIOC_4_IR_OUT         AM_HC32_GPIO_REMAP_CODE(0x03, 3)

/** @} */

/**
 * \name PIOC_4引脚复用时功能模式
 * @{
 */
#define PIOC_4_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOC_4_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOC_4_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOC_4_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOC_4_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOC_4_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOC_4_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

